In [1]:
import pandas as pd

In [2]:
baby_names = pd.read_csv('US_Baby_Names_right.csv')

In [3]:
baby_names.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

# Delete unnamed columns

In [5]:
baby_names_clean = baby_names.drop('Unnamed: 0', axis=1)
#baby_names.drop(baby_names.columns[baby_names.columns.str.contains('Unnamed')], axis=1).head()
baby_names_clean.head()

      Id     Name  Year Gender State  Count
0  11350     Emma  2004      F    AK     62
1  11351  Madison  2004      F    AK     48
2  11352   Hannah  2004      F    AK     46
3  11353    Grace  2004      F    AK     44
4  11354    Emily  2004      F    AK     41

# 2. Show the distribution of male and female

In [17]:
baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

# 3. Show the top 5 most preferred names

In [19]:
baby_names['Name'].value_counts().head()

Riley     1112
Avery     1080
Jordan    1073
Peyton    1064
Hayden    1049
Name: Name, dtype: int64

# 4. What is the median name occurrence in the dataset

In [55]:
total_count = baby_names['Name'].dropna().count()
# string will work only if count is odd
med_index = ((baby_names['Name'].dropna().count() + 1)/2).astype(int)
print(med_index)

baby_names['Name'].dropna().sort_values().iloc[((baby_names['Name'].dropna().count() +1)/2).astype(int)]

#sort_values().count()

508198

'Jocelyn'

# 5. Distribution of male and female born count by states

In [94]:
baby_names.groupby(['Gender', 'State']).count()['Count']
#.count()['Count']

Gender  State
F       AK        2404
        AL        9878
        AR        7171
        AZ       14518
        CA       45144
        CO       11424
        CT        6575
        DC        3053
        DE        2549
        FL       25781
        GA       19385
        HI        3255
        IA        7131
        ID        4918
        IL       21268
        IN       13056
        KS        7753
        KY        8817
        LA       10510
        MA       10580
        MD       11276
        ME        2976
        MI       16038
        MN       10677
        MO       11948
        MS        7235
        MT        2690
        NC       17357
        ND        2399
        NE        5370
                 ...
M       ME        2777
        MI       13243
        MN        9004
        MO        9917
        MS        6862
        MT        2986
        NC       13530
        ND        2581
        NE        5029
        NH        2659
        NJ       12274
        NM        4966
        NV        6024
        NY       22585
        OH       14318
        OK        8138
        OR        7333
        PA       14171
        RI        2468
        SC        8195
        SD        2908
        TN       10588
        TX       27791
        UT        8233
        VA       11997
        VT        1618
        WA       11049
        WI        8940
        WV        3733
        WY        1904
Name: Count, Length: 102, dtype: int64